muhittinkaplan/stm32/Stm32f051/Stm32f051_SimComm/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define DG_INPUT_0_Pin GPIO_PIN_4
#define DG_INPUT_0_GPIO_Port GPIOA
#define DG_INPUT_1_Pin GPIO_PIN_5
#define DG_INPUT_1_GPIO_Port GPIOA
#define DG_INPUT_2_Pin GPIO_PIN_6
#define DG_INPUT_2_GPIO_Port GPIOA
#define DG_INPUT_3_Pin GPIO_PIN_7
#define DG_INPUT_3_GPIO_Port GPIOA
#define SYS_RUN_LED_Pin GPIO_PIN_12
#define SYS_RUN_LED_GPIO_Port GPIOB
#define SYS_ERROR_LED_Pin GPIO_PIN_13
#define SYS_ERROR_LED_GPIO_Port GPIOB
#define DG_OUTPUT_3_Pin GPIO_PIN_6
#define DG_OUTPUT_3_GPIO_Port GPIOC
#define DG_OUTPUT_2_Pin GPIO_PIN_7
#define DG_OUTPUT_2_GPIO_Port GPIOC
#define DG_OUTPUT_1_Pin GPIO_PIN_8
#define DG_OUTPUT_1_GPIO_Port GPIOC
#define DG_OUTPUT_0_Pin GPIO_PIN_9
#define DG_OUTPUT_0_GPIO_Port GPIOC
#define SWDIO_Pin GPIO_PIN_13
#define SWDIO_GPIO_Port GPIOA
#define SWCLK_Pin GPIO_PIN_14
#define SWCLK_GPIO_Port GPIOA
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
